obervic/ESP32S3CAMSIM7670/ESP32-RTSPTransport.c
/*
 * Communication.c
 *
 *  Created on: 29 июн. 2025 г.
 *      Author: Victor
 *
 * Updated from C++ library
 */


#include "ESP32-RTSPTransport.h"

#include "esp_mac.h"
#include "esp_mac.h"
#include "esp_mac.h"
#include "libb64/cencode.h" // Include libb64 library
#include "libb64/cdecode.h" // Include libb64 library for decoding

IPAddress CURR_IP={239, 255, 0, 1};

const char* LOG_TAG = "RTSPServer";
TRTSPServer VRTSPServer= { 
    VIDEO_AND_SUBTITLES, // Default transport 
    EN_H264,
    REMOTE,
    0,
    0,
    554,
    {239, 255, 0, 1}, // Default RTP IP 
    64, // Default TTL
    5430,
    5432,
    5434,
    3,
    //
    -1,
    -1,
    -1, 
    -1,
    -1,
    -1,
    -1,
     0,
    1,
    NULL,
    NULL,
    NULL,
    0,
    true,
    true,
    true,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    false,
    false,
    false,
    false,
    false,
    false,
    false,
    false, // Initialize authEnabled to false
    true,
    true,
    false,
    


   };
TRTSPServer *RTSPServer;

  
void RTSPServerCreate()
{
	if (RTSPServer==NULL)
	 {
		 RTSPServer=&RTSPServer;
		
      }
}

void RTSPServerDestroy() 
{
  // Clean up resources
  	if (RTSPServer==NULL)
	 {
		 RTSPServer=&VRTSPServer;
		
      }
  RTSPServerdeinit();
  vSemaphoreDelete(RTSPServer->isPlayingMutex);
  vSemaphoreDelete(RTSPServer->sendTcpMutex);
  vSemaphoreDelete(RTSPServer->maxClientsMutex);
}

bool RTSPServerinit(TTransportType transport,TServerType ServerType,TVIDEO_ENCODING EncodingFormat, uint16_t rtspPort, uint32_t sampleRate, uint16_t port1, uint16_t port2, uint16_t port3, IPAddress rtpIp, uint8_t rtpTTL)
 {
   	 
  RTSPServer->transport = (transport != NONE) ? transport : RTSPServer->transport;
  RTSPServer->rtspPort = (rtspPort != 0) ? rtspPort : RTSPServer->rtspPort;
  for (uint8_t i=0;i<4;i++)RTSPServer->rtpIp[i] =  rtpIp[1] ;
  RTSPServer->rtpTTL = (rtpTTL != 255) ? rtpTTL : RTSPServer->rtpTTL;

  if (transport == AUDIO_ONLY || transport == VIDEO_AND_AUDIO || transport == AUDIO_AND_SUBTITLES || transport == VIDEO_AUDIO_SUBTITLES) {
    if (RTSPServer->sampleRate == 0 && sampleRate == 0) {
     
      return false;
    }
    if (sampleRate != 0) {
      RTSPServer->sampleRate = sampleRate;
    }
  }

  switch (RTSPServer->transport) {
    case VIDEO_ONLY:
      RTSPServer->rtpVideoPort = (port1 != 0) ? port1 : RTSPServer->rtpVideoPort;
      RTSPServer->isVideo = true;
      break;
    case AUDIO_ONLY:
      RTSPServer->rtpAudioPort = (port1 != 0) ? port1 : RTSPServer->rtpAudioPort;
      RTSPServer->isAudio = true;
      break;
    case SUBTITLES_ONLY:
      RTSPServer->rtpSubtitlesPort = (port1 != 0) ? port1 : RTSPServer->rtpSubtitlesPort;
      RTSPServer->isSubtitles = true;
      break;
    case VIDEO_AND_AUDIO:
      RTSPServer->rtpVideoPort = (port1 != 0) ? port1 : RTSPServer->rtpVideoPort;
      RTSPServer->rtpAudioPort = (port2 != 0) ? port2 : RTSPServer->rtpAudioPort;
      RTSPServer->isVideo = true;
      RTSPServer->isAudio = true;
      break;
    case VIDEO_AND_SUBTITLES:
      RTSPServer->rtpVideoPort = (port1 != 0) ? port1 : RTSPServer->rtpVideoPort;
      RTSPServer->rtpSubtitlesPort = (port2 != 0) ? port2 : RTSPServer->rtpSubtitlesPort;
      RTSPServer->isVideo = true;
      RTSPServer->isSubtitles = true;
      break;
    case AUDIO_AND_SUBTITLES:
      RTSPServer->rtpAudioPort = (port1 != 0) ? port1 : RTSPServer->rtpAudioPort;
      RTSPServer->rtpSubtitlesPort = (port2 != 0) ? port2 : RTSPServer->rtpSubtitlesPort;
      RTSPServer->isAudio = true;
      RTSPServer->isSubtitles = true;
      break;
    case VIDEO_AUDIO_SUBTITLES:
      RTSPServer->rtpVideoPort = (port1 != 0) ? port1 : RTSPServer->rtpVideoPort;
      RTSPServer->rtpAudioPort = (port2 != 0) ? port2 : RTSPServer->rtpAudioPort;
      RTSPServer->rtpSubtitlesPort = (port3 != 0) ? port3 : RTSPServer->rtpSubtitlesPort;
      RTSPServer->isVideo = true;
      RTSPServer->isAudio = true;
      RTSPServer->isSubtitles = true;
      break;
    case NONE:
      RTSP_LOGE(LOG_TAG, "Transport type can not be NONE");
      return false;
    default:
      RTSP_LOGE(LOG_TAG, "Invalid transport type for RTSPServer init method");
      return false;
  }
    RTSPServer->isPlayingMutex=xSemaphoreCreateMutex(); // Initialize the mutex
    RTSPServer->sendTcpMutex=xSemaphoreCreateMutex(); // Initialize the mutex
    RTSPServer->maxClientsMutex=xSemaphoreCreateMutex();
    return RTSPServerprepRTSP();
}

void RTSPServerdeinit() {
  if (RTSPServer->rtspTaskHandle != NULL) {
    vTaskDelete(RTSPServer->rtspTaskHandle);
    RTSPServer->rtspTaskHandle = NULL;
  }
  if (RTSPServer->rtpVideoTaskHandle != NULL) {
    vTaskDelete(RTSPServer->rtpVideoTaskHandle);
    RTSPServer->rtpVideoTaskHandle = NULL;
  }
  if (RTSPServer->rtspSocket >= 0) {
    close(RTSPServer->rtspSocket);
    RTSPServer->rtspSocket = -1;
  }
  
  RTSPServercloseSockets();
  
  if (RTSPServer->rtspStreamBuffer) {
    free(RTSPServer->rtspStreamBuffer);
  }

  RTSP_LOGI(LOG_TAG, "RTSP server deinitialized.");
}

bool RTSPServerreinit() {
  RTSPServerdeinit();
  return RTSPServerinit(VIDEO_AND_SUBTITLES,REMOTE,EN_H264,0,0,0,0,0,CURR_IP,0);
}

void RTSPServercloseSockets() {
  if (VRTSPServer.videoUnicastSocket != -1) {
    close(VRTSPServer.videoUnicastSocket);
    VRTSPServer.videoUnicastSocket = -1;
  }
  if (VRTSPServer.audioUnicastSocket != -1) {
    close(VRTSPServer.audioUnicastSocket);
    VRTSPServer.audioUnicastSocket = -1;
  }
  if (VRTSPServer.subtitlesUnicastSocket != -1) {
    close(VRTSPServer.subtitlesUnicastSocket);
    VRTSPServer.subtitlesUnicastSocket = -1;
  }
  if (VRTSPServer.videoMulticastSocket != -1) {
    close(VRTSPServer.videoMulticastSocket);
    VRTSPServer.videoMulticastSocket = -1;
  }
  if (VRTSPServer.audioMulticastSocket != -1) {
    close(VRTSPServer.audioMulticastSocket);
    VRTSPServer.audioMulticastSocket = -1;
  }
  if (VRTSPServer.subtitlesMulticastSocket != -1) {
    close(VRTSPServer.subtitlesMulticastSocket);
    VRTSPServer.subtitlesMulticastSocket = -1;
  }
}

