obervic/ESP32S3CAMSIM7670/ESP32-RTSPTransport.c
bool RTSPServerprepRTSP() {
  uint64_t mac;
  esp_efuse_mac_get_default((uint8_t*)&mac);
  RTSPServer->videoSSRC = (uint32_t)(mac & 0xFFFFFFFF);
  RTSPServer->audioSSRC = (uint32_t)((mac >> 32) & 0xFFFFFFFF);
  RTSPServer->subtitlesSSRC = (uint32_t)((mac >> 48) & 0xFFFFFFFF);

  RTSPServer->rtspSocket = socket(AF_INET, SOCK_STREAM, 0);
  if (RTSPServer->rtspSocket < 0) {
    RTSP_LOGE(LOG_TAG, "Failed to create RTSP socket.");
    return false;
  }

  if (!RTSPServersetNonBlocking(RTSPServer->rtspSocket)) {
    RTSP_LOGE(LOG_TAG, "Failed to set RTSP socket to non-blocking mode.");
    close(RTSPServer->rtspSocket);
    return false;
  }

  struct sockaddr_in serverAddr;
  serverAddr.sin_family = AF_INET;
  serverAddr.sin_addr.s_addr = INADDR_ANY;
  serverAddr.sin_port = htons(RTSPServer->rtspPort);

  if (bind(RTSPServer->rtspSocket, (struct sockaddr *)&serverAddr, sizeof(serverAddr)) < 0) {
    RTSP_LOGE(LOG_TAG, "Failed to bind RTSP socket: %d", RTSPServer->rtspSocket);
    close(RTSPServer->rtspSocket);
    return false;
  }
  
  if (listen(RTSPServer->rtspSocket, 5) < 0) {
    RTSP_LOGE(LOG_TAG, "Failed to listen on RTSP socket.");
    close(RTSPServer->rtspSocket);
    return false;
  }

  if (RTSPServer->rtspTaskHandle == NULL) {
    if (xTaskCreate(RTSPServerrtspTaskWrapper, "rtspTask", RTSP_STACK_SIZE, RTSPServer, RTSP_PRI, &RTSPServer->rtspTaskHandle) != pdPASS) {
      RTSP_LOGE(LOG_TAG, "Failed to create RTSP task.");
      close(RTSPServer->rtspSocket);
      return false;
    }
  }

  RTSP_LOGI(LOG_TAG, "RTSP server setup completed, listening on port: %d", RTSPServer->rtspPort);
  return true;
}

void RTSPServerrtspTaskWrapper(void* pvParameters) {
  TRTSPServer* server = (TRTSPServer*)(pvParameters);
  RTSPServerrtspTask(server);
}

void RTSPServerrtspTask(TRTSPServer* server) {
  struct sockaddr_in clientAddr;
  socklen_t addr_len = sizeof(clientAddr);
  fd_set read_fds;
  int client_sockets[MAX_CLIENTS] = {0};
  int max_sd, activity, client_sock;

  while (true) {
    FD_ZERO(&read_fds);
    FD_SET(RTSPServer->rtspSocket, &read_fds);
    max_sd = RTSPServer->rtspSocket;

    uint8_t currentMaxClients = RTSPServergetMaxClients();

    for (int i = 0; i < currentMaxClients; i++) {
      int sd = client_sockets[i];
      if (sd > 0) FD_SET(sd, &read_fds);
      if (sd > max_sd) max_sd = sd;
    }

    activity = select(max_sd + 1, &read_fds, NULL, NULL, NULL);

    if (activity < 0 && errno != EINTR) {
      RTSP_LOGE(LOG_TAG, "Select error");
      continue;
    }

    if (FD_ISSET(server->rtspSocket, &read_fds)) {
      if (RTSPServergetActiveRTSPClients() >= currentMaxClients) {
        client_sock = accept(RTSPServer->rtspSocket, (struct sockaddr *)&clientAddr, &addr_len);
        if (client_sock < 0) {
          RTSP_LOGE(LOG_TAG, "Accept error");
          continue;
        }

        const char* response = "RTSP/1.0 503 Service Unavailable\r\n\r\n";
        write(client_sock, response, strlen(response));
        close(client_sock);
        RTSP_LOGE(LOG_TAG, "Max clients reached. Sent 503 error to new client.");
        continue;
      }

      client_sock = accept(RTSPServer->rtspSocket, (struct sockaddr *)&clientAddr, &addr_len);
      if (client_sock < 0) {
        RTSP_LOGE(LOG_TAG, "Accept error");
        continue;
      }

      if (!RTSPServersetNonBlocking(client_sock)) {
        RTSP_LOGE(LOG_TAG, "Failed to set RTSP socket to non-blocking mode.");
        close(client_sock);
        continue;
      }

      RTSP_LOGI(LOG_TAG, "New client connected");

      // Create a new session for the new client
      TRTSP_Session session = {
        esp_random(),  // sessionID
        client_sock,   // sock
        0,            // cseq
        0,            // cVideoPort
        0,            // cAudioPort
        0,            // cSrtPort
        false,        // isMulticast
        false,        // isPlaying
        false,        // isTCP
        false,        // isHttp
        -1,           // httpSock
        {0}           // sessionCookie (initialized as empty)
      };
      //sessions[session->sessionID] = session;

      for (int i = 0; i < currentMaxClients; i++) {
        if (client_sockets[i] == 0) {
          client_sockets[i] = client_sock;
          RTSPServerincrementActiveRTSPClients();
          RTSP_LOGI(LOG_TAG, "Added to list of sockets as %d", i);
          break;
        }
      }
    }

    for (int i = 0; i < currentMaxClients; i++) {
      int sd = client_sockets[i];

      if (FD_ISSET(sd, &read_fds)) {
        // Get the session for RTSPServer client
        TRTSP_Session* session = NULL;
        /*
        for (auto& sess : sessions) {
          if (sess.second.sock == sd) {
            session = &sess.second;
            break;
          }
        }*/
        if (session) {
          bool keepConnection = RTSPServerhandleRTSPRequest(session);
          if (!keepConnection) {
            if (RTSPServergetActiveRTSPClients() == 1) {
              RTSPServersetIsPlaying(false);
              RTSPServercloseSockets();
              RTSP_LOGD(LOG_TAG, "All clients disconnected. Resetting firstClientConnected flag."); 
              RTSPServer->firstClientConnected = false; 
              RTSPServer->firstClientIsMulticast = false; 
              RTSPServer->firstClientIsTCP = false; 
            }
            close(sd);
            client_sockets[i] = 0;
            //sessions.erase(session->sessionID); // Remove session when client disconnects
            RTSPServerdecrementActiveRTSPClients();
          }
        }
      }
    }
  }
}

void RTSPServerwrapInHTTP(char* buffer, size_t len, char* response, size_t maxLen) {
    snprintf(response, maxLen,
             "HTTP/1.1 200 OK\r\n"
             "Content-Type: application/x-rtsp-tunnelled\r\n"
             "Content-Length: %d\r\n"
             "Pragma: no-cache\r\n"
             "Cache-Control: no-cache\r\n"
             "\r\n"
             "%s",
             len, buffer);
}

/**
 * @brief Handles the OPTIONS RTSP request.
 * 
 * @param request The RTSP request.
 * @param session The RTSP session->
 */

void RTSPServerhandleOptions(char* request, TRTSP_Session *session) {
  char* urlStart = strstr(request, "rtsp://");
  if (urlStart) {
    char* pathStart = strchr(urlStart + 7, '/');
    char* pathEnd = strchr(pathStart, ' ');
    if (pathStart && pathEnd) {
      *pathEnd = 0; // Null-terminate the path
      // Path can be processed here if needed
    }
  }
  
  char response[512];
  const char* publicMethods = "Public: OPTIONS, DESCRIBE, SETUP, PLAY, PAUSE, TEARDOWN\r\n\r\n";
  
  snprintf(response, sizeof(response), 
           "RTSP/1.0 200 OK\r\n"
           "CSeq: %d\r\n"
           "%s\r\n"
           "%s",
           session->cseq, 
           RTSPServerdateHeader(), 
           publicMethods);
  
  if (session->isHttp) {
    char httpResponse[1024];
    RTSPServerwrapInHTTP(response, strlen(response), httpResponse, sizeof(httpResponse));
    write(session->httpSock, httpResponse, strlen(httpResponse));
  } else {
    write(session->sock, response, strlen(response));
  }
}

/**
 * @brief Handles the DESCRIBE RTSP request.
 * 
 * @param session The RTSP session->
 */
void RTSPServerhandleDescribe(const TRTSP_Session *session) {
  char sdpDescription[512];
  int sdpLen = snprintf(sdpDescription, sizeof(sdpDescription),
                        "v=0\r\n"
                        "o=- %u 1 IN IP4 %s\r\n"
                        "s=\r\n"
                        "c=IN IP4 0.0.0.0\r\n"
                        "t=0 0\r\n"
                        "a=control:*\r\n",
                         session->sessionID, RTSPServer->rtpIp);

