obervic/ESP32S3CAMSIM7670/ESP32-RTSPTransport.c
  if (RTSPServer->isVideo) {
    sdpLen += snprintf(sdpDescription + sdpLen, sizeof(sdpDescription) - sdpLen,
                       "m=video 0 RTP/AVP 26\r\n"
                       "a=control:video\r\n");
  }

  const char* mediaCondition = "sendrecv"; 
  // if (haveMic && haveAmp) mediaCondition = "sendrecv"; 
  // else if (haveMic) mediaCondition = "sendonly"; 
  // else if (haveAmp) mediaCondition = "recvonly"; 
  // else mediaCondition = "inactive"; 

  if (RTSPServer->isAudio) {
    sdpLen += snprintf(sdpDescription + sdpLen, sizeof(sdpDescription) - sdpLen,
                       "m=audio 0 RTP/AVP 97\r\n"
                       "a=rtpmap:97 L16/%u/1\r\n"
                       "a=control:audio\r\n"
                       "a=%s\r\n", RTSPServer->sampleRate, mediaCondition);
  }

  if (RTSPServer->isSubtitles) {
    sdpLen += snprintf(sdpDescription + sdpLen, sizeof(sdpDescription) - sdpLen,
                       "m=text 0 RTP/AVP 98\r\n"
                       "a=rtpmap:98 t140/1000\r\n"
                       "a=control:subtitles\r\n");
  }

  char response[1024];
  int responseLen = snprintf(response, sizeof(response),
                             "RTSP/1.0 200 OK\r\nCSeq: %d\r\n%s\r\nContent-Base: rtsp://%s:554/\r\nContent-Type: application/sdp\r\nContent-Length: %d\r\n\r\n"
                             "%s",
                             session->cseq, RTSPServerdateHeader(), RTSPServer->rtpIp, sdpLen, sdpDescription);
  
  write(session->isHttp ? session->httpSock : session->sock, response, responseLen);
}

/**
 * @brief Handles the SETUP RTSP request.
 * 
 * @param request The RTSP request.
 * @param session The RTSP session->
 */
void RTSPServerhandleSetup(char* request, TRTSP_Session *session) {
  session->isMulticast = strstr(request, "multicast") != NULL;
  session->isTCP = strstr(request, "RTP/AVP/TCP") != NULL;

#ifndef OVERRIDE_RTSP_SINGLE_CLIENT_MODE
  // Track the first client's connection type
  if (!RTSPServer->firstClientConnected) {
    RTSPServer->firstClientConnected = true;
    RTSPServer->firstClientIsMulticast = session->isMulticast;
    RTSPServer->firstClientIsTCP = session->isTCP;

    // Set max clients based on the first client's connection type, accounting for HTTP tunneling
    if (session->isHttp) {
        // Keep current max clients since it was already increased for HTTP tunneling
        RTSP_LOGD(LOG_TAG, "Keeping current max clients for HTTP tunneling");
    } else {
        RTSPServersetMaxClients(RTSPServer->firstClientIsMulticast ? RTSPServer->maxRTSPClients : 1);
    }
  } else {
    // Determine if the connection should be rejected
    bool placeholder = RTSPServer->firstClientIsTCP;
    bool rejectConnection =
        (RTSPServer->firstClientIsMulticast && !session->isMulticast) ||
        (!RTSPServer->firstClientIsMulticast &&
         (session->isMulticast || session->isTCP != placeholder));

    if (rejectConnection) {
      RTSP_LOGW(LOG_TAG, "Rejecting connection because it does not match the first client's connection type");
      char response[512];
      snprintf(response, sizeof(response),
               "RTSP/1.0 461 Unsupported Transport\r\n"
               "CSeq: %d\r\n"
               "%s\r\n\r\n",
               session->cseq, RTSPServerdateHeader());
      if (write(session->sock, response, strlen(response)) < 0) {
        RTSP_LOGE(LOG_TAG, "Failed to send rejection response to client.");
      }
      return;
    }
  }
#else
  setMaxClients(RTSPServer->maxRTSPClients);
#endif

  bool setVideo = strstr(request, "video") != NULL;
  bool setAudio = strstr(request, "audio") != NULL;
  bool setSubtitles = strstr(request, "subtitles") != NULL;
  uint16_t clientPort = 0;
  uint16_t serverPort = 0;
  uint8_t rtpChannel = 0;

  // Extract client port or RTP channel based on transport method
  if (session->isTCP) {
    char* interleaveStart = strstr(request, "interleaved=");
    if (interleaveStart) {
      interleaveStart += 12;
      char* interleaveEnd = strchr(interleaveStart, '-');
      if (interleaveStart && interleaveEnd) {
        *interleaveEnd = 0;
        rtpChannel = atoi(interleaveStart);
        RTSP_LOGD(LOG_TAG, "Extracted RTP channel: %d", rtpChannel);
      } else {
        RTSP_LOGE(LOG_TAG, "Failed to find interleave end");
      }
    } else {
      RTSP_LOGE(LOG_TAG, "Failed to find interleaved=");
    }
  } else if (!session->isMulticast) {
    char* rtpPortStart = strstr(request, "client_port=");
    if (rtpPortStart) {
      rtpPortStart += 12;
      char* rtpPortEnd = strchr(rtpPortStart, '-');
      if (rtpPortStart && rtpPortEnd) {
        *rtpPortEnd = 0;
        clientPort = atoi(rtpPortStart);
        RTSP_LOGD(LOG_TAG, "Extracted client port: %d", clientPort);
      } else {
        RTSP_LOGE(LOG_TAG, "Failed to find client port end");
      }
    } else {
      RTSP_LOGE(LOG_TAG, "Failed to find client_port=");
    }
  }

  // Setup video, audio, or subtitles based on the request
  if (setVideo) {
    session->cVideoPort = clientPort;
    serverPort = RTSPServer->rtpVideoPort;
    RTSPServer->videoCh = rtpChannel;
    if (!session->isTCP) {
      if (session->isMulticast) {
        RTSPServercheckAndSetupUDP(&RTSPServer->videoMulticastSocket, true, serverPort, RTSPServer->rtpIp);
      } else {
        RTSPServercheckAndSetupUDP(&RTSPServer->videoUnicastSocket, false, serverPort, RTSPServer->rtpIp);
      }
    }
  }
  
  if (setAudio) {
    session->cAudioPort = clientPort;
    serverPort = RTSPServer->rtpAudioPort;
    RTSPServer->audioCh = rtpChannel;
    if (!session->isTCP) {
      if (session->isMulticast) {
        RTSPServercheckAndSetupUDP(&RTSPServer->audioMulticastSocket, true, serverPort, RTSPServer->rtpIp);
      } else {
        RTSPServercheckAndSetupUDP(&RTSPServer->audioUnicastSocket, false, serverPort, RTSPServer->rtpIp);
      }
    }
  }
  
  if (setSubtitles) {
    session->cSrtPort = clientPort;
    serverPort = RTSPServer->rtpSubtitlesPort;
    RTSPServer->subtitlesCh = rtpChannel;
    if (!session->isTCP) {
      if (session->isMulticast) {
        RTSPServercheckAndSetupUDP(&RTSPServer->subtitlesMulticastSocket, true, serverPort, RTSPServer->rtpIp);
      } else {
        RTSPServercheckAndSetupUDP(&RTSPServer->subtitlesUnicastSocket, false, serverPort, RTSPServer->rtpIp);
      }
    }
  }


