obervic/ESP32S3CAMSIM7670/ESP32-RTSPTransport.c
#ifdef RTSP_VIDEO_NONBLOCK
  if (setVideo && RTSPServer->rtpVideoTaskHandle == NULL) {
    xTaskCreate(rtpVideoTaskWrapper, "rtpVideoTask", RTP_STACK_SIZE, RTSPServer, RTP_PRI, &RTSPServer->rtpVideoTaskHandle);
  }
  if (RTSPServer->rtspStreamBuffer == NULL && psramFound()) {
    RTSPServer->rtspStreamBuffer = (uint8_t*)ps_malloc(MAX_RTSP_BUFFER);
  }
#endif

  char* response = (char*)malloc(512);
  if (response == NULL) {
    RTSP_LOGE(LOG_TAG, "Failed to allocate memory");
    return;
  }

  // Formulate the response based on transport method
  if (session->isTCP) {
    snprintf(response, 512,
             "RTSP/1.0 200 OK\r\n"
             "CSeq: %d\r\n"
             "%s\r\n"
             "Transport: RTP/AVP/TCP;unicast;interleaved=%d-%d\r\n"
             "Session: %u\r\n\r\n",
             session->cseq, RTSPServerdateHeader(), rtpChannel, rtpChannel + 1, session->sessionID);
  } else if (session->isMulticast) {
    snprintf(response, 512,
             "RTSP/1.0 200 OK\r\nCSeq: %d\r\n%s\r\nTransport: RTP/AVP;multicast;destination=%s;port=%d-%d;ttl=%d\r\nSession: %u\r\n\r\n",
             session->cseq, RTSPServerdateHeader(), RTSPServer->rtpIp, serverPort, serverPort + 1, RTSPServer->rtpTTL, session->sessionID);
  } else {
    snprintf(response, 512,
             "RTSP/1.0 200 OK\r\nCSeq: %d\r\n%s\r\nTransport: RTP/AVP;unicast;destination=127.0.0.1;source=127.0.0.1;client_port=%d-%d;server_port=%d-%d\r\nSession: %u\r\n\r\n",
             session->cseq, RTSPServerdateHeader(), clientPort, clientPort + 1, serverPort, serverPort + 1, session->sessionID);
  }

  write(session->isHttp ? session->httpSock : session->sock, response, strlen(response));
  
  free(response);
  //RTSPServer->sessions[session->sessionID] = session;
}

/**
 * @brief Handles the PLAY RTSP request.
 * 
 * @param session The RTSP session->
 */
void RTSPServerhandlePlay(TRTSP_Session *session) {
  session->isPlaying = true;
//  RTSPServer->sessions[session->sessionID] = session;
  RTSPServersetIsPlaying(true);

  char response[256];
  snprintf(response, sizeof(response),
           "RTSP/1.0 200 OK\r\n"
           "CSeq: %d\r\n"
           "%s\r\n"
           "Range: npt=0.000-\r\n"
           "Session: %u\r\n"
           "RTP-Info: url=rtsp://127.0.0.1:554/\r\n\r\n",
           session->cseq,
           RTSPServerdateHeader(),
           session->sessionID);

  write(session->isHttp ? session->httpSock : session->sock, response, strlen(response));
}

/**
 * @brief Handles the PAUSE RTSP request.
 * 
 * @param session The RTSP session->
 */
void RTSPServerhandlePause(TRTSP_Session * session) {
  session->isPlaying = false;
 // RTSPServer->sessions[session->sessionID] = session;
  RTSPServerupdateIsPlayingStatus();
  char response[128];
  int len = snprintf(response, sizeof(response),
                     "RTSP/1.0 200 OK\r\nCSeq: %d\r\nSession: %u\r\n\r\n",
                     session->cseq, session->sessionID);
  
  write(session->isHttp ? session->httpSock : session->sock, response, len);
  RTSP_LOGD(LOG_TAG, "Session %u is now paused.", session->sessionID);
}

/**
 * @brief Handles the TEARDOWN RTSP request.
 * 
 * @param session The RTSP session->
 */
void RTSPServerhandleTeardown(TRTSP_Session * session) {
  session->isPlaying = false;
//  RTSPServer->sessions[session->sessionID] = session;
  RTSPServerupdateIsPlayingStatus();

  char response[128];
  int len = snprintf(response, sizeof(response),
                     "RTSP/1.0 200 OK\r\nCSeq: %d\r\nSession: %u\r\n\r\n",
                     session->cseq, session->sessionID);
  
  write(session->isHttp ? session->httpSock : session->sock, response, len);

  RTSP_LOGD(LOG_TAG, "RTSP Session %u has been torn down.", session->sessionID);
}

/**
 * @brief Handles incoming RTSP requests.
 * 
 * @param sock The socket file descriptor.
 * @param clientAddr The client address.
 * @return true if the request was handled successfully, false otherwise.
 */
bool RTSPServerhandleRTSPRequest(TRTSP_Session * session) {
  void *placeholder = malloc(RTSP_BUFFER_SIZE);
 
  char *buffer = (char *)placeholder;
  if (!buffer) {
    RTSP_LOGE(LOG_TAG, "Failed to allocate buffer with ps_malloc");
    return false;
  }

  int totalLen = 0;
  int len = 0;

  // Read data from socket until end of RTSP header or buffer limit is reached
  while ((len = recv(session->sock, buffer + totalLen, RTSP_BUFFER_SIZE - totalLen - 1, 0)) > 0) {
    totalLen += len;
    if (strstr(buffer, "\r\n\r\n")) {
      break;
    }
    if (totalLen >= RTSP_BUFFER_SIZE) { // Adjusted for null-terminator
      RTSP_LOGE(LOG_TAG, "Request too large for buffer. Total length: %d", totalLen);
      free(buffer); // Free allocated memory
      return false;
    }
  }

  if (totalLen <= 0) {
    int err = errno;
    free(buffer);
    if (err == EWOULDBLOCK || err == EAGAIN) {
      return true;
    } else if (err == ECONNRESET || err == ENOTCONN) {
      RTSP_LOGD(LOG_TAG, "Connection reset/closed - HandleTeardown");
      // Handle teardown for current session
      RTSPServerhandleTeardown(session);
      // If RTSPServer is an HTTP session, find and teardown both GET and POST sessions
      if (session->isHttp && session->sessionCookie[0] != '\0') {
          // Find the paired session
          TRTSP_Session* pairedSession = RTSPServerfindSessionByCookie(session->sessionCookie);
          if (pairedSession && pairedSession != &session) {
              RTSP_LOGD(LOG_TAG, "Found paired HTTP session, handling teardown");
              RTSPServerhandleTeardown(pairedSession);
          }
      }
      
      return false;
    } else {
      RTSP_LOGE(LOG_TAG, "Error reading from socket, error: %d", err);
      return false;
    }
  }

  // Check to see if RTCP packet and ignore for now...
  buffer[totalLen] = 0; // Null-terminate the buffer
  if (buffer[0] == '$') {
    free(buffer); // Free allocated memory
    return true; 
  }

  uint8_t firstByte = buffer[0]; 
  uint8_t version = (firstByte >> 6) & 0x03;
  if (version == 2) { 
    uint8_t payloadType = buffer[1] & 0x7F;
    if (payloadType >= 200 && payloadType <= 204) {
      free(buffer); // Free allocated memory
      return true;
    }
    free(buffer); // Free allocated memory
    return true;
  }

