obervic/ESP32S3CAMSIM7670/ESP32-RTSPTransport.c
  // Check if the request is base64 encoded FIRST
  RTSP_LOGD(LOG_TAG, "Checking if base64 encoded");
  
  if (RTSPServerisBase64Encoded(buffer, totalLen)) {
    RTSP_LOGD(LOG_TAG, "Buffer is base64 encoded, decoding...");
    char* decodedBuffer = (char*)malloc(RTSP_BUFFER_SIZE);
    if (!decodedBuffer) {
      RTSP_LOGE(LOG_TAG, "Failed to allocate memory for decoded buffer");
      free(buffer);
      return false;
    }

    size_t decodedLen;
    if (RTSPServerdecodeBase64(buffer, totalLen, decodedBuffer, &decodedLen)) {
      RTSP_LOGD(LOG_TAG, "Decoded buffer: %s", decodedBuffer);
      free(buffer);
      buffer = decodedBuffer;
      totalLen = decodedLen;
    } else {
      RTSP_LOGE(LOG_TAG, "Failed to decode base64 buffer");
      free(decodedBuffer);
      free(buffer);
      return false;
    }
  }

  int cseq = RTSPServercaptureCSeq(buffer);
  if (cseq == -1) {
    RTSP_LOGE(LOG_TAG, "CSeq not found in request: %s", buffer);
    write(session->sock, "RTSP/1.0 400 Bad Request\r\n\r\n", 29);
    free(buffer); // Free allocated memory
    return true;
  }

  session->cseq = cseq;

  // Extract session ID using the provided function
  uint32_t sessionID = RTSPServerextractSessionID(buffer);
  /*
  if (sessionID != 0 && sessions->find(sessionID) != sessions->end()) {
    session->sessionID = sessionID;
  }
*/
  // Authentication check
  if (RTSPServer->authEnabled) {
    char* authHeader = strstr(buffer, "Authorization: Basic ");
    if (!authHeader) {
      RTSPServersendUnauthorizedResponse(session);
      free(buffer); // Free allocated memory
      return true;
    } else {
      authHeader += 21; // Move pointer to the base64 encoded credentials
      char* authEnd = strstr(authHeader, "\r\n");
      if (authEnd) {
        *authEnd = 0; // Null-terminate the base64 string
        if (strcmp(authHeader, RTSPServer->base64Credentials) != 0) {
          RTSPServersendUnauthorizedResponse(session);
          free(buffer); // Free allocated memory
          return true;
        } else {
          // Remove the Authorization header from the buffer before continuing
          memmove(authHeader - 21, authEnd + 2, strlen(authEnd + 2) + 1);
        }
      } else {
        RTSPServersendUnauthorizedResponse(session);
        free(buffer); // Free allocated memory
        return true;
      }
    }
  }

  // Handle HTTP tunneling methods first
  if (strncmp(buffer, "GET / HTTP/", 10) == 0 && strstr(buffer, "Accept: application/x-rtsp-tunnelled")) {
    RTSP_LOGD(LOG_TAG, "Handle GET HTTP Request: %s", buffer);
    
    // Increase max clients by 1 to account for HTTP tunneling
    uint8_t currentMaxClients = RTSPServergetMaxClients();
    RTSPServersetMaxClients(currentMaxClients + 1);
    RTSP_LOGD(LOG_TAG, "Increased max clients to %d for HTTP tunneling", currentMaxClients + 1);
    
    session->isHttp = true;
    char sessionCookie[MAX_COOKIE_LENGTH];
    RTSPServerextractSessionCookie(buffer, sessionCookie, sizeof(sessionCookie));
    strncpy(session->sessionCookie, sessionCookie, MAX_COOKIE_LENGTH - 1);
    session->sessionCookie[MAX_COOKIE_LENGTH - 1] = '\0';

    char response[512];
    snprintf(response, sizeof(response),
             "HTTP/1.1 200 OK\r\n"  // Use HTTP/1.1 for better compatibility
             "Server: ESP32\r\n"
             "Connection: keep-alive\r\n"
             "%s"
             "Cache-Control: no-store\r\n"
             "Pragma: no-cache\r\n"
             "Content-Type: application/x-rtsp-tunnelled\r\n"
             "\r\n",
             RTSPServerdateHeader());
    write(session->sock, response, strlen(response));  // Use direct socket for initial HTTP response
  }
  else if (strncmp(buffer, "POST / HTTP/", 11) == 0 && strstr(buffer, "Content-Type: application/x-rtsp-tunnelled")) {
    RTSP_LOGD(LOG_TAG, "RTSP-over-HTTP Tunnel Established");
    RTSP_LOGD(LOG_TAG, "Handle POST HTTP Request: %s", buffer);
    
    // Extract cookie from POST request
    char sessionCookie[MAX_COOKIE_LENGTH];
    RTSPServerextractSessionCookie(buffer, sessionCookie, sizeof(sessionCookie));
    
    // Find corresponding GET session
    TRTSP_Session* getSession = RTSPServerfindSessionByCookie(sessionCookie);
    if (getSession) {
        // Keep POST session but use GET session's socket for responses
        session->httpSock = getSession->sock;
        session->isHttp = true;
        strncpy(session->sessionCookie, sessionCookie, MAX_COOKIE_LENGTH - 1);
        session->sessionCookie[MAX_COOKIE_LENGTH - 1] = '\0';
    } else {
        RTSP_LOGE(LOG_TAG, "No matching GET session found for cookie: %s", sessionCookie);
    }
  } else {
    // Handle regular RTSP commands
    RTSPServerhandleRTSPCommand(buffer, session);
  }

  free(buffer);
  return true;
}

void RTSPServersendUnauthorizedResponse(TRTSP_Session * session) {
  char response[256];
  snprintf(response, sizeof(response),
           "RTSP/1.0 401 Unauthorized\r\n"
           "CSeq: %d\r\n"
           "WWW-Authenticate: Basic realm=\"ESP32\"\r\n\r\n",
           session->cseq);
  
  write(session->isHttp ? session->httpSock : session->sock, response, strlen(response));
  RTSP_LOGW(LOG_TAG, "Sent 401 Unauthorized response to client.");
}

void RTSPServerhandleRTSPCommand(char* command, TRTSP_Session * session) {
  if (strncmp(command, "OPTIONS", 7) == 0) {
    RTSP_LOGD(LOG_TAG, "Handle RTSP Options");
    RTSPServerhandleOptions(command, session);
  } else if (strncmp(command, "DESCRIBE", 8) == 0) {
    RTSP_LOGD(LOG_TAG, "Handle RTSP Describe");
    RTSPServerhandleDescribe(session);
  } else if (strncmp(command, "SETUP", 5) == 0) {
    RTSP_LOGD(LOG_TAG, "Handle RTSP Setup");
    RTSPServerhandleSetup(command, session);
  } else if (strncmp(command, "PLAY", 4) == 0) {
    RTSP_LOGD(LOG_TAG, "Handle RTSP Play");
    RTSPServerhandlePlay(session);
  } else if (strncmp(command, "TEARDOWN", 8) == 0) {
    RTSP_LOGD(LOG_TAG, "Handle RTSP Teardown");
    RTSPServerhandleTeardown(session);
  } else if (strncmp(command, "PAUSE", 5) == 0) {
    RTSP_LOGD(LOG_TAG, "Handle RTSP Pause");
    RTSPServerhandlePause(session);
  } else {
    RTSP_LOGW(LOG_TAG, "Unknown RTSP method: %s", command);
  }
}

bool RTSPServerisBase64Encoded(const char* buffer, size_t length) {
    // First check for spaces - if found, not base64
    for (size_t i = 0; i < length; i++) {
        if (isspace(buffer[i])) {
            return false;
        }
    }

    // Now check if it's valid base64
    if (length % 4 != 0) {
        return false;
    }

