obervic/ESP32S3CAMSIM7670/ESP32-RTSPTransport.c
    for (size_t i = 0; i < length; i++) {
        if (!isalnum(buffer[i]) && 
            buffer[i] != '+' && 
            buffer[i] != '/' && 
            buffer[i] != '=') {
            return false;
        }
    }

    return true;
}

void RTSPServerextractSessionCookie(const char* buffer, char* sessionCookie, size_t maxLen) {
    const char* cookieHeader = strstr(buffer, "x-sessioncookie:");
    if (cookieHeader) {
        cookieHeader += strlen("x-sessioncookie:");
        while (*cookieHeader == ' ') cookieHeader++;
        const char* end = strstr(cookieHeader, "\r\n");
        size_t len = end ? (size_t)(end - cookieHeader) : strlen(cookieHeader);
        len = len < maxLen ? len : maxLen - 1;
        strncpy(sessionCookie, cookieHeader, len);
        sessionCookie[len] = '\0';
    } else {
        sessionCookie[0] = '\0';
    }
}

TRTSP_Session* RTSPServerfindSessionByCookie(const char* cookie) {
   /* for (auto& pair : sessions) {
        if (strcmp(pair.second.sessionCookie, cookie) == 0) {
            return &pair.second;
        }
    }*/
    return NULL;
}




void RTSPServerstartSubtitlesTimer(esp_timer_cb_t userCallback) { 
  const esp_timer_create_args_t timerConfig = { 
    .callback = userCallback, // User-defined callback function 
    .arg = NULL, // Optional argument, can be set to NULL
    .dispatch_method = ESP_TIMER_TASK, // Dispatch method, set to default
    .name = "periodic_timer" ,
    .skip_unhandled_events = false // Optional, can be set to false
    }; 
    //esp_timer_create(&timerConfig, &sendSubtitlesTimer); 
    //esp_timer_start_periodic(sendSubtitlesTimer, 1000000); 
}

void RTSPServersetMaxClients(uint8_t newMaxClients) {
  if (xSemaphoreTake(RTSPServer->maxClientsMutex, portMAX_DELAY) == pdTRUE) {
    if (newMaxClients <= MAX_CLIENTS) {
      RTSPServer->maxClients = newMaxClients;
      RTSP_LOGI(LOG_TAG, "Max clients updated to: %d", RTSPServer->maxClients);
    } else {
      RTSP_LOGW(LOG_TAG, "Requested max clients (%d) exceeds the hardcoded limit (%d). Max clients set to %d.", newMaxClients, MAX_CLIENTS, MAX_CLIENTS);
      RTSPServer->maxClients = MAX_CLIENTS;
    }
    xSemaphoreGive(RTSPServer->maxClientsMutex);
  } else {
    RTSP_LOGE(LOG_TAG, "Failed to acquire maxClients mutex");
  }
}

uint8_t RTSPServergetMaxClients() {
  uint8_t clients = 0;
  if (xSemaphoreTake(RTSPServer->maxClientsMutex, portMAX_DELAY) == pdTRUE) {
    clients = RTSPServer->maxClients;
    xSemaphoreGive(RTSPServer->maxClientsMutex);
  } else {
    RTSP_LOGE(LOG_TAG, "Failed to acquire maxClients mutex");
  }
  return clients;
}

void RTSPServerincrementActiveRTSPClients() {
  if (RTSPServer->activeRTSPClients < 255) {
    RTSPServer->activeRTSPClients++;
    RTSP_LOGI(LOG_TAG, "Active RTSP clients count incremented: %d", RTSPServer->activeRTSPClients);
  } else {
    RTSP_LOGW(LOG_TAG, "Max RTSP clients reached: %d", 255);
  }
}

void RTSPServerdecrementActiveRTSPClients() {
  if (RTSPServer->activeRTSPClients > 0) {
    RTSPServer->activeRTSPClients--;
    RTSP_LOGI(LOG_TAG, "Active RTSP clients count decremented: %d", RTSPServer->activeRTSPClients);
  } else {
    RTSP_LOGW(LOG_TAG, "Min RTSP clients already: %d", 0);
  }
}

uint8_t RTSPServergetActiveRTSPClients() {
  return RTSPServer->activeRTSPClients;
}

void RTSPServerupdateIsPlayingStatus() {
  bool anyClientStreaming = false;
  /*for (const auto& sessionPair : sessions) {
    if (sessionPair.second.isPlaying) {
      anyClientStreaming = true;
      break;
    }
  }*/
  RTSPServersetIsPlaying(anyClientStreaming);
}

void RTSPServersetIsPlaying(bool playing) {
    xSemaphoreTake(RTSPServer->isPlayingMutex, portMAX_DELAY);
    RTSPServer->isPlaying = playing;
    xSemaphoreGive(RTSPServer->isPlayingMutex);
}

bool RTSPServergetIsPlaying()  {
    bool playing;
    xSemaphoreTake(RTSPServer->isPlayingMutex, portMAX_DELAY);
    playing = RTSPServer->isPlaying;
    xSemaphoreGive(RTSPServer->isPlayingMutex);
    return playing;
}

bool RTSPServerreadyToSendFrame()  {
  return RTSPServergetIsPlaying() && RTSPServer->rtpFrameSent;
}

bool RTSPServerreadyToSendAudio()  {
  return RTSPServergetIsPlaying() && RTSPServer->rtpAudioSent;
}

bool RTSPServerreadyToSendSubtitles()  {
  return RTSPServergetIsPlaying() && RTSPServer->rtpSubtitlesSent;
}

int RTSPServercaptureCSeq(char* request) {
  char* cseqStr = strstr(request, "CSeq: ");
  if (cseqStr == NULL) {
    return -1;
  }
  cseqStr += 6;
  char* endOfLine = strchr(cseqStr, '\n');
  if (endOfLine) {
    *endOfLine = 0;
  }
  int cseq = atoi(cseqStr);
  if (endOfLine) {
    *endOfLine = '\n';
  }
  return cseq;
}

uint32_t RTSPServergenerateSessionID() {
  return esp_random();
}

uint32_t RTSPServerextractSessionID(char* request) {
  char* sessionStr = strstr(request, "Session: ");
  if (sessionStr == NULL) {
    return 0;
  }
  sessionStr += 9;
  char* endOfLine = strchr(sessionStr, '\n');
  if (endOfLine) {
    *endOfLine = 0;
  }

  while (isspace(*sessionStr)) sessionStr++;
  char* end = sessionStr + strlen(sessionStr) - 1;
  while (end > sessionStr && isspace(*end)) end--;
  *(end + 1) = 0;

  uint32_t sessionID = strtoul(sessionStr, NULL, 10);

  if (endOfLine) {
    *endOfLine = '\n';
  }

  return sessionID;
}

const char* RTSPServerdateHeader() {
  static char buffer[50];
  time_t now = time(NULL);
  strftime(buffer, sizeof(buffer), "Date: %a, %d %b %Y %H:%M:%S GMT", gmtime(&now));
  return buffer;
}

bool RTSPServersetCredentials(const char* username, const char* password) {
  if (username && password && strlen(username) > 0 && strlen(password) > 0) {
    char credentials[128];
    snprintf(credentials, sizeof(credentials), "%s:%s", username, password);

    // Base64 encode the credentials
    base64_encodestate state;
    base64_init_encodestate(&state);
    int encodedLen = base64_encode_chars(credentials, strlen(credentials), &RTSPServer->base64Credentials);
    RTSPServer->base64Credentials[encodedLen] = '\0'; // Null-terminate the encoded string

    RTSPServer->authEnabled = true;
    RTSP_LOGI(LOG_TAG, "Authentication enabled with provided credentials.");
    return true; // Indicate success
  } else {
    RTSPServer->authEnabled = false;
    RTSP_LOGI(LOG_TAG, "Authentication disabled.");
    return false; // Indicate failure
  }
}

bool RTSPServerdecodeBase64(const char* input, size_t inputLen, char* output, size_t* outputLen) {
    base64_decodestate state;
    base64_init_decodestate(&state);
    int len = base64_decode_block(input, inputLen, output, &state);
    if (len >= 0) {
        *outputLen = len;
        output[len] = '\0';
        return true;
    }
    return false;
}



void RTSPServercheckAndSetupUDP(int *rtpSocket, bool isMulticast, uint16_t rtpPort, IPAddress rtpIp) {
  if (*rtpSocket == -1) {
    *rtpSocket = socket(AF_INET, SOCK_DGRAM, 0);
    if (*rtpSocket < 0) {
      RTSP_LOGE(LOG_TAG, "Failed to create RTP socket");
      return;
    }
    if (!RTSPServersetNonBlocking(*rtpSocket)) {
      RTSP_LOGE(LOG_TAG, "Failed to set RTP socket to non-blocking mode.");
      close(*rtpSocket);
      return;
    }
    struct sockaddr_in rtpAddr;
    memset(&rtpAddr, 0, sizeof(rtpAddr));
    rtpAddr.sin_family = AF_INET;
    rtpAddr.sin_port = htons(rtpPort);
    if (isMulticast) {
      inet_aton(RTSPServer->rtpIp, &rtpAddr.sin_addr);
      setsockopt(*rtpSocket, IPPROTO_IP, IP_MULTICAST_TTL, &RTSPServer->rtpTTL, sizeof(RTSPServer->rtpTTL));
    } else {
      rtpAddr.sin_addr.s_addr = INADDR_ANY;
      if (bind(*rtpSocket, (struct sockaddr *)&rtpAddr, sizeof(rtpAddr)) < 0) {
        RTSP_LOGE(LOG_TAG, "Failed to bind RTP socket on port %d", rtpPort);
        return;
      }
    }
  }
}

void RTSPServersendTcpPacket(const uint8_t* packet, size_t packetSize, int sock) {
  if (xSemaphoreTake(RTSPServer->sendTcpMutex, portMAX_DELAY) == pdTRUE) {
    ssize_t sent = 0;
    while (sent < packetSize) {
      ssize_t result = send(sock, packet + sent, packetSize - sent, 0);
      if (result < 0) {
        int err = errno;
        if (err == EAGAIN || err == EWOULDBLOCK) {
          fd_set write_fds;
          FD_ZERO(&write_fds);
          FD_SET(sock, &write_fds);
          //struct timeval tv = { .tv_sec = 0, .tv_usec = 100000 }; // 100ms
          int ret = select(sock + 1, NULL, &write_fds, NULL, NULL);
          if (ret <= 0) {
            RTSP_LOGE(LOG_TAG, "Failed to send TCP packet, select timeout or error");
            break;
          }
          continue;
        } else if (err != EPIPE && err != ECONNRESET && err != ENOTCONN && err != EBADF) {
          RTSP_LOGE(LOG_TAG, "Failed to send TCP packet, errno: %d", err);
          break;
        } else {
          break;
        }
      } else {
        sent += result;
      }
    }
    xSemaphoreGive(RTSPServer->sendTcpMutex);
  } else {
    RTSP_LOGE(LOG_TAG, "Failed to acquire mutex");
  }
}

bool RTSPServersetNonBlocking(int sock) { 
  int flags = fcntl(sock, F_GETFL, 0); 
  if (flags == -1) { 
    RTSP_LOGE(LOG_TAG, "Failed to get socket flags"); 
    return false; 
  } 
  if (fcntl(sock, F_SETFL, flags | O_NONBLOCK) == -1) { 
    RTSP_LOGE(LOG_TAG, "Failed to set socket to non-blocking mode"); 
    return false;
  } 
  RTSP_LOGI(LOG_TAG, "Socket set to non-blocking mode");
  return true;
}


